// Методы (Руководство по программированию на C#) содержит информацию  про методы,их вызовы,правельность написания методов, и их примеры
//Передача параметров (Руководство по программированию в C#)содержит информацию  про ппередачу параметров через ref и по значению
//return (Справочник по C#)содержит информацию  про функцию return его специфику и пример написания
//ref (Справочник по C#) содержит информацию про функцию ref,способы её применения и тд
//Модификатор параметров out (справочник по C#) содержит информацию  про функцию out,её отличие от ref и in,её ограничение,и её применение
//Рекомендуемые XML-теги для комментариев к документации по C# в этой статье рассписаны XML-теги,их виды,различия,и примеры применения,а также рекомендации по применению XML-тегов
//Практическое руководство. Вставка XML-комментариев для создания документации в этой статье обьясняеться предудыщая тема но со стороны практики(примеры написания),а также алгоритм вставки XML-комментариев для элемента кода
//XML документация в C# теги для комментариев к документации по C#
//Модификатор параметров in (справочник по C#) рассказываться про функцию in,её специфику,ограничение и правила разрешения перегрузки